Catalogs/АС_НастройкиИндикацииОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_НастройкиИндикацииОстатков</Name>
			<Comment>Общие и индивидуальные пороги цветовой индикации доступного остатка номенклатуры.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Пустое значение используется только у предопределённой общей настройки.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пороги</Name>
					<Comment>Цвет применяется к остатку не больше указанного количества и больше предыдущего порога.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Верхняя включительная граница диапазона остатка.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветHEX</Name>
							<Comment>Цвет фона в формате #RRGGBB.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АС_ИндикацияОстатковСервер/Ext/Module.bsl
Функция НастройкиОформления() Экспорт

	ОбщаяИндикация = ПредопределенноеЗначение(
		"Справочник.АС_НастройкиИндикацииОстатков.ОбщаяИндикация");
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|Настройки.Ссылка КАК Настройка,
		|Настройки.Номенклатура КАК Номенклатура,
		|НастройкиПороги.Количество КАК ВерхняяГраница,
		|НастройкиПороги.ЦветHEX КАК ЦветHEX,
		|ВЫБОР
		|	КОГДА Настройки.Ссылка = &ОбщаяИндикация
		|		ТОГДА 1
		|	ИНАЧЕ 0
		|КОНЕЦ КАК ЭтоОбщаяИндикация
		|ИЗ
		|Справочник.АС_НастройкиИндикацииОстатков КАК Настройки
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АС_НастройкиИндикацииОстатков.Пороги КАК НастройкиПороги
		|	ПО Настройки.Ссылка = НастройкиПороги.Ссылка
		|ГДЕ
		|НЕ Настройки.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|ЭтоОбщаяИндикация УБЫВ,
		|Настройки.Номенклатура,
		|НастройкиПороги.Количество");
	Запрос.УстановитьПараметр("ОбщаяИндикация", ОбщаяИндикация);

	Правила = Новый Массив;
	ИсключенияОбщейИндикации = Новый Массив;
	ПредыдущаяНастройка = Неопределено;
	НижняяГраница = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Настройка <> ПредыдущаяНастройка Тогда
			ПредыдущаяНастройка = Выборка.Настройка;
			НижняяГраница = Неопределено;
			Если Выборка.ЭтоОбщаяИндикация = 0
				И ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
				ИсключенияОбщейИндикации.Добавить(Выборка.Номенклатура);
			КонецЕсли;
		КонецЕсли;

		Попытка
			ЦветФона = РаботаСЦветомСервер.ЦветПоHEX(Выборка.ЦветHEX);
		Исключение
			Продолжить;
		КонецПопытки;
		Правила.Добавить(Новый Структура(
			"Номенклатура,ВерхняяГраница,НижняяГраница,ЦветФона",
			Выборка.Номенклатура,
			Выборка.ВерхняяГраница,
			НижняяГраница,
			ЦветФона));
		НижняяГраница = Выборка.ВерхняяГраница;
	КонецЦикла;

	Возврат Новый Структура(
		"Правила,ИсключенияОбщейИндикации",
		Правила,
		ИсключенияОбщейИндикации);

КонецФункции
